app/controllers/question_controller.rb

  def current_question()
    Question.find_by(quizz_id: current_quiz.id, index: params[:index])
---
SELECT "questions".* FROM "questions" WHERE "questions"."quizz_id" = ? AND "questions"."index" = ? LIMIT ?  [["quizz_id", 25], ["index", 1], ["LIMIT", 1]]