app/controllers/quiz_controller.rb

SELECT "scores".* FROM "scores" WHERE "scores"."quizz_id" = ? AND "scores"."user_id" = ?  [["quizz_id", 24], ["user_id", 1]]
---
  def intro
    previous_scores = Score.where(quizz_id: params[:id], user_id: current_user.id)
    @attempts = previous_scores.length