app/controllers/score_controller.rb

  def get_all_results
    result = Score.all.map { |score| {
      "id"=> score.id,
      "passed"=>score.passed,
      "user" => User.find(score.user_id).email, #TODO : add username and change there.
      "quiz" => Quiz.find(score.quizz_id).title,
      "grade"=>score.grade
---
SELECT "scores".* FROM "scores"
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def get_user_results
    result = Score.where(user: current_user).map { |score| {
      "id" => score.id,
      "passed"=>score.passed,
      "user" => current_user.email, #TODO : add username and change there.
      "quiz" => Quiz.find(score.quizz_id).title,
      "grade"=>score.grade
---
SELECT "scores".* FROM "scores" WHERE "scores"."user_id" = ?  [["user_id", 7]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def grade_user
    current_quiz = Quiz.find(params[:id])
    current_score = session[:tmp_score].to_i || 0
    current_score = 0 unless current_score < 6 #Don't cheat!
    has_passed = current_score >= 3
    Score.create!(user: current_user, grade: current_score, quizz_id: current_quiz.id, passed: has_passed, score: current_score)
---
INSERT INTO "scores" ("quizz_id", "user_id", "score", "passed", "grade") VALUES (?, ?, ?, ?, ?)  [["quizz_id", 29], ["user_id", 9], ["score", 5], ["passed", 1], ["grade", 5]]